OF_Sims/SIMPLE/Simple_80/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom        latestTime;

startTime       0;

stopAt           endTime;

endTime         10;

deltaT          0.0001;

writeControl     runTime;

writeInterval    0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep true;

maxCo   0.99;

functions
{
    
    // Load the library containing the 'coded' functionObject
    libs            ("libutilityFunctionObjects.so");


}


// ************************************************************************* //
